const DUMMY_DATA = [
    {
        id: 'f1',
        title: 'سامانه خدمات بیرق چیست و چه خدماتی ارائه میدهد ؟',
        desc: 'لورم ایپسوم متن ساختگی  با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود  ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده  شناخت فراوان جامعه و متخصصان را می طلبد تا با  نرم افزارها  شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. این صورت می توان  امید داشت که تمام و دشواری موجود ',
    },
    {
        id: 'f2',
        title: 'سامانه خدمات بیرق چیست و چه خدماتی ارائه میدهد ؟',
        desc: 'لورم ایپسوم متن ساختگی  با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود  ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده  شناخت فراوان جامعه و متخصصان را می طلبد تا با  نرم افزارها  شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. این صورت می توان  امید داشت که تمام و دشواری موجود',
    },
    {
        id: 'f3',
        title: 'سامانه خدمات بیرق چیست و چه خدماتی ارائه میدهد ؟',
        desc: 'لورم ایپسوم متن ساختگی  با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود  ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده  شناخت فراوان جامعه و متخصصان را می طلبد تا با  نرم افزارها  شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. این صورت می توان  امید داشت که تمام و دشواری موجود',
    },
    {
        id: 'f4',
        title: 'سامانه خدمات بیرق چیست و چه خدماتی ارائه میدهد ؟',
        desc: 'لورم ایپسوم متن ساختگی  با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود  ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده  شناخت فراوان جامعه و متخصصان را می طلبد تا با  نرم افزارها  شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. این صورت می توان  امید داشت که تمام و دشواری موجود',
    },
    {
        id: 'f5',
        title: 'سامانه خدمات بیرق چیست و چه خدماتی ارائه میدهد ؟',
        desc: 'لورم ایپسوم متن ساختگی  با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود  ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده  شناخت فراوان جامعه و متخصصان را می طلبد تا با  نرم افزارها  شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. این صورت می توان  امید داشت که تمام و دشواری موجود',
    },
    {
        id: 'f6',
        title: 'سامانه خدمات بیرق چیست و چه خدماتی ارائه میدهد ؟',
        desc: 'لورم ایپسوم متن ساختگی  با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود  ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده  شناخت فراوان جامعه و متخصصان را می طلبد تا با  نرم افزارها  شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. این صورت می توان  امید داشت که تمام و دشواری موجود',
    },{
        id: 'f7',
        title: 'سامانه خدمات بیرق چیست و چه خدماتی ارائه میدهد ؟',
        desc: 'لورم ایپسوم متن ساختگی  با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود  ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده  شناخت فراوان جامعه و متخصصان را می طلبد تا با  نرم افزارها  شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. این صورت می توان  امید داشت که تمام و دشواری موجود',
    },
    {
        id: 'f8',
        title: 'سامانه خدمات بیرق چیست و چه خدماتی ارائه میدهد ؟',
        desc: 'لورم ایپسوم متن ساختگی  با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود  ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده  شناخت فراوان جامعه و متخصصان را می طلبد تا با  نرم افزارها  شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. این صورت می توان  امید داشت که تمام و دشواری موجود',
    },


];

export const allFaqs = () => {
    return DUMMY_DATA;
}