const DUMMY_DATA = [
    {
        id: 'p1',
        title: 'کفش روزمره شوپا',
        image: 'images/product/1.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
    {
        id: 'p2',
        title: 'گوشی موبایل سامسونگ A52',
        image: 'images/product/2.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
    {
        id: 'p3',
        title: 'کتاب نیمه تاریک وجود',
        image: 'images/product/3.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
    {
        id: 'p4',
        title: 'هدست بلوتوثی ریمکس مدل AirPod3',
        image: 'images/product/4.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
    {
        id: 'p5',
        title: 'تیشرت مردانه باینت',
        image: 'images/product/5.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
    {
        id: 'p6',
        title: 'ساعت مچی عقربه ای مردانه کاسیو',
        image: 'images/product/6.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
    {
        id: 'p7',
        title: 'کتاب نیمه تاریک وجود',
        image: 'images/product/3.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
    {
        id: 'p8',
        title: 'اسپرسوساز زیگما مدل rl-222',
        image: 'images/product/7.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
    {
        id: 'p9',
        title: 'لپتاپ 14 اینچی ایسوس R465FA',
        image: 'images/product/8.jpg',
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم ',
        price: 590000,
        discount: '',
    },
];

export const allProducts = () => {
    return DUMMY_DATA;
};