import Mobile from "../components/icons/shop/mobile";
import Dress from "../components/icons/shop/dress";
import Game from "../components/icons/shop/game";
import Sofa from "../components/icons/shop/sofa";
import Manto from "../public/images/shopservice/1.png";
import Hedset from "../public/images/shopservice/2.png";
import Mive from "../public/images/shopservice/3.png";
import Xbox from "../public/images/shopservice/4.png";
import Mac from "../public/images/shopservice/mac.png";
import Mac1 from "../public/images/shopservice/mac1.png";
import Mac2 from "../public/images/shopservice/mac2.png";
import Mac3 from "../public/images/shopservice/mac3.png";

const DUMMY_DATA = [
    {
        id: 1,
        name: "لوازم دیجیتالی",
        icon: <Mobile />,
        products: [
            {
                id: "d1",
                name: "موبایل و تبلت"
            },
            {
                id: "d2",
                name: "رایانه"
            },
            {
                id: "d3",
                name: "کنسول بازی"
            },
        ]
    },
    {
        id: 2,
        name: "خانه و آشپزخانه",
        icon: <Sofa />,
        products: [
            {
                id: "a1",
                name: "یخچال"
            },
            {
                id: "a2",
                name: "اجاق گاز"
            },
        ]
    },
    {
        id: 3,
        name: "بازی و سرگرمی",
        icon: <Game />,
        products: [
            {
                id: "b1",
                name: "PS5"
            },
            {
                id: "b2",
                name: "XBOX/S"
            },
        ]
    },
    {
        id: 4,
        name: "مد و پوشاک",
        icon: <Dress />,
        products: []
    },
]
export const ShopData = () => {
    return DUMMY_DATA;
};


const DUMMY_DATAS = [
    {
        id: "sh1",
        title: "Macbook Pro 2019 mv932 i9",
        group: "لوازم دیجیتالی",
        image: Mac,
        price: 50000000,
        city: "تهران",
        description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد",
        slider: [
            {
                img: Mac,
            },
            {
                img: Mac1,
            },
            {
                img: Mac2,
            },
            {
                img: Mac3,
            },
        ],
        detail: [
            {
                name: "برند",
                value: "اپل Apple",
            },
            {
                name: "وضعیت",
                value: "درحد نو",
            },
            {
                name: "ظرفیت حافظه داخلی",
                value: "512 گیگابایت",
            },
            {
                name: "پردازنده",
                value: "Core i9",
            },
            {
                name: "اندازه صفحه نمایش",
                value: "15.4 اینچ",
            },
            {
                name: "قیمت",
                value: 50000000,
                unit: "تومان",
            },
        ],
    },
    {
        id: "sh2",
        title: "میوه خوری پایه استیل",
        group: "خانه و آشپزخانه",
        image: Mive,
        price: 51000,
        city: "اصفهان",
        description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد",
        detail: [{}],
    },
    {
        id: "sh3",
        title: "xbox one all digital",
        group: "لوازم دیجیتالی",
        image: Xbox,
        price: 980000,
        city: "مشهد",
        description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد",
        detail: [{}],
    },
    {
        id: "sh4",
        title: "مانتو جنس میکرو",
        group: "مد و پوشاک",
        image: Manto,
        price: 190000,
        city: "مازندران",
        description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد",
        detail: [{}],
    },
    {
        id: "sh5",
        title: "هدست بلوتوثی ریمکس",
        group: "لوازم دیجیتالی",
        image: Hedset,
        price: 30000,
        city: "تهران",
        description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد",
        detail: [{}],
    },
    {
        id: "sh6",
        title: "میوه خوری پایه استیل",
        group: "خانه و آشپزخانه",
        image: Mive,
        price: 51000,
        city: "اصفهان",
        description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد",
        detail: [{}],
    },
    {
        id: "sh7",
        title: "xbox one all digital",
        group: "لوازم دیجیتالی",
        image: Xbox,
        price: 980000,
        city: "مشهد",
        description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد",
        detail: [{}],
    },
    {
        id: "sh8",
        title: "مانتو جنس میکرو",
        group: "مد و پوشاک",
        image: Manto,
        price: 190000,
        city: "مازندران",
        description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد",
        detail: [{}],
    },
]
export const AllShopData = () => {
    return DUMMY_DATAS;
};